
console.log('number' + 3 + 3); /* number33 - тут відбувається конкатинація тому що стрінга з цифрами додаються */

console.log(null + 3); /* 3 - null це нічого, тому буде просто 3 */

console.log(5 && "qwerty"); /* qwerty - логічне AND, повернуло expr2 тому що 5 не може конвертнутися в false */

console.log(+'40' + +'2' + "hillel"); /* 42hillel - конкатинація стрінгів */

console.log('10' - 5 === 6); /* false - тому що стрінга мінус цифра не дорівнює 6  */

console.log(true + false); /* 1 - тому що true переводиться в 1, а false в 0 */

console.log('4px' - 3); /* NaN - спроба перевести '4px' призвела до NaN, а операції з NaN дорівнюють NaN*/

console.log('4' - 3); /* 1  - стрінга '4' переводиться в цифру 4 і рахується як 4 - 3 = 1 */

console.log('6' + 3 ** 0); /*  61 - тому що спочатку порахували 3 в нульовий степені, і коли даодали строку 6 то відбулася конкатенація за правилами js*/

console.log(12 / '6'); /*  2 - джава перевела стрінгу 6 у цифру і отримала в результаті ділення 2*/

console.log('10' + (5 === 6)); /*  10false - конкатинація стрінги 10 з результатом false( тому що 5 строго дорівнює 6 це false  */

console.log(null == ''); /*  false - null це порожність, нічого, воно не може дорівнювати пустій строчці, тому false*/

console.log(3 ** (9 / 3)); /* 27 - спочатку разую те що у дужках, а потім зводить у ступінь */

console.log(!!'false' == !!'true'); /* true - тому що 'false' - java приведе до true, і 'true' теж буде true */

console.log(0 || '0' && 1); /* 1  - спочатку виконається '0' І 1 буде 1, а потім 0 або 1 то буде 1*/

console.log((+null == false) < 1); /* false - спочатку в скобках буде true, тому що +null=0 і false приведеться до 0, потім true < 1 буде false тому що true приведеться до 1 (1 < 1 це false)*/

console.log(false && true || true); /* true - false І true буде false, потім false АБО true повертає true */

console.log(false && (false || true)); /* false - спочатку у скобках обчислиться до true, потім false І true обчислиться до false */

console.log((+null == false) < 1 ** 5); /*  false - спочатку в скобках буде true, тому що +null=0 і false приведеться до 0, потім true < 1**5 буде false тому що true приведеться до 1*/

